#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-eA4wYooDeCkYed6k

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_cloudwatch_event_rule.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_cloudwatch_event_rule.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_lambda_function.SQSLambda: Refreshing state... [id=ien-dev-notifylambda]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_instance.bastion_instance: Refreshing state... [id=i-019ffb9c39279483f]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_function.SyncApplicants: Refreshing state... [id=ien-dev-syncdata]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_lambda_permission.hmbc_to_ien_masters: Refreshing state... [id=AllowExecutionFromCloudWatch_Morning]
aws_cloudwatch_event_target.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters-terraform-20220421203905121600000002]
aws_lambda_permission.hmbc_to_ien_applicants: Refreshing state... [id=AllowExecutionFromCloudWatch_EarlyMorning]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_cloudwatch_event_target.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants-terraform-20220421203905110400000001]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.SQSLambda has changed
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
      + layers                         = []
      + tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_sqs_queue.terraform_queue has changed
  ~ resource "aws_sqs_queue" "terraform_queue" {
        id                                = "https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue"
        name                              = "slack-notification-queue"
      + tags                              = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.event_source_mapping will be created
  + resource "aws_lambda_event_source_mapping" "event_source_mapping" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:588188670678:slack-notification-queue"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:ca-central-1:588188670678:function:ien-dev-notifylambda"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.SQSLambda will be updated in-place
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
        tags                           = {}
      ~ timeout                        = 300 -> 30
        # (24 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"                 = "9de0e3a" -> "c7b1d58"
              ~ "BUILD_INFO"               = "9de0e3a, Bhumin Patel, WIP-test-SQS-and-Lambda-on-dev-env, grafted, HEAD, tag: refs/tags/dev" -> "c7b1d58, GitHub, Merge-543deb6e16980989bc4f249963d7cf31a9d0a580-into-6e3725263dae9d904676cfb2f52a526cb5949eba, grafted, HEAD, refs/remotes/pull/196/merge"
                # (6 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants will be updated in-place
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "9de0e3a" -> "c7b1d58"
              ~ "BUILD_INFO"        = "9de0e3a, Bhumin Patel, WIP-test-SQS-and-Lambda-on-dev-env, grafted, HEAD, tag: refs/tags/dev" -> "c7b1d58, GitHub, Merge-543deb6e16980989bc4f249963d7cf31a9d0a580-into-6e3725263dae9d904676cfb2f52a526cb5949eba, grafted, HEAD, refs/remotes/pull/196/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "9de0e3a" -> "c7b1d58"
              ~ "BUILD_INFO"        = "9de0e3a, Bhumin Patel, WIP-test-SQS-and-Lambda-on-dev-env, grafted, HEAD, tag: refs/tags/dev" -> "c7b1d58, GitHub, Merge-543deb6e16980989bc4f249963d7cf31a9d0a580-into-6e3725263dae9d904676cfb2f52a526cb5949eba, grafted, HEAD, refs/remotes/pull/196/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>